#+TITLE: StatisticsWithJulia Introducing Julia - DRAFT
#+AUTHOR: GTrunSec
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE: 2021-01-04 Mon 23:58
#+SETUPFILE: ../../../hugo.setup
#+SETUPFILE: ../../../theme-readtheorg.setup
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t


*** Link on page 21: [[https://github.com/h-Klok/StatsWithJuliaBook/blob/master/1_chapter/fast.jl][Fast code example]]
:PROPERTIES:
:NOTER_PAGE: (21 . 0.727734)
:END:

#+begin_src julia :async t :exports both :results output
using Statistics

@time begin
    data = [mean(rand(5*10^2)) for _ in 1:10^6]
    println("98% of the means lie in the estimated range: ",
                    (quantile(data,0.01),quantile(data,0.99)) )
end
#+end_src

#+RESULTS:
: 98% of the means lie in the estimated range: (0.46996439638573045, 0.5300740324223876)
:   1.127390 seconds (1.74 M allocations: 3.936 GiB, 7.61% gc time)

**** Link on page 31: [[https://github.com/h-Klok/StatsWithJuliaBook/blob/master/1_chapter/bubbleSort.jl][Bubble sort]]
:PROPERTIES:
:NOTER_PAGE: (31 . 0.093426)
:END:


#+begin_src julia :exports both :results output
function bubbleSort!(a)
    n = length(a)
    for i in 1:n-1
        for j in 1:n-i
            if a[j] > a[j+1]
                a[j], a[j+1] = a[j+1], a[j]
            end
        end
    end
    return a
end

data = [65, 51, 32, 12, 23, 84, 68, 1]
bubbleSort!(data)
#+end_src

#+RESULTS:
#+begin_example
bubbleSort! (generic function with 1 method)
8-element Array{Int64,1}:
 65
 51
 32
 12
 23
 84
 68
  1
8-element Array{Int64,1}:
  1
 12
 23
 32
 51
 65
 68
 84
#+end_example


**** Link on page 32: [[https://github.com/h-Klok/StatsWithJuliaBook/blob/master/1_chapter/polyRoots.jl][Roots of a polynomial]]
:PROPERTIES:
:NOTER_PAGE: (32 . 0.651217)
:END:

x=−3±√32−4(−10)2(−10)=3±720⇒x1= 0.5,  x2=−0.2

#+begin_src julia :async t :exports both :results output
using Roots

function polynomialGenerator(a...)
    n = length(a)-1
    poly =  function(x)
                return sum([a[i+1]*x^i for i in 0:n])
            end
    return poly
end

polynomial = polynomialGenerator(1,3,-10)
zeroVals = find_zeros(polynomial,-10,10)
println("Zeros of the function f(x): ", zeroVals)
#+end_src

#+RESULTS:
: polynomialGenerator (generic function with 1 method)
: #1 (generic function with 1 method)

